Revit 2026 API

# RebarSpliceUtilsCanRebarBeSpliced(Rebar, RebarSpliceOptions, Line, ElementId) Method

---

Verifies if the rebar can be spliced with the provided line.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RebarSpliceError CanRebarBeSpliced(
	Rebar rebar,
	RebarSpliceOptions spliceOptions,
	Line line,
	ElementId viewId
)
```
```vb
Public Shared Function CanRebarBeSpliced (
	rebar As Rebar,
	spliceOptions As RebarSpliceOptions,
	line As Line,
	viewId As ElementId
) As RebarSpliceError
```
```cpp
public:
static RebarSpliceError CanRebarBeSpliced(
	Rebar^ rebar,
	RebarSpliceOptions^ spliceOptions,
	Line^ line,
	ElementId^ viewId
)
```
```fsharp
static member CanRebarBeSpliced :
        rebar : Rebar *
        spliceOptions : RebarSpliceOptions *
        line : Line *
        viewId : ElementId -> RebarSpliceError
```

#### Parameters

rebar Rebar
     The rebar to be spliced.
spliceOptions RebarSpliceOptions
     The RebarSpliceOptions.
line Line
     The line to splice the rebar with.
viewId ElementId
     Based on the view it will be determined the plane of the line.

#### Return Value

RebarSpliceError Will return RebarSpliceError.Success if it's possible to splice with line or other enum value corresponding to the error that occurred.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method uses the view normal in case of a 2D view and the current workplane normal in case of a 3D view.

If the view normal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be split.

Otherwise, the line will be extended to exceed the bounding box of the bar.

#### Reference

RebarSpliceUtils Class

CanRebarBeSpliced Overload

Autodesk.Revit.DB.Structure Namespace